zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/MCXA567/MCXA567_COMMON.h
/*
** ###################################################################
**     Processors:          MCXA567VLL
**                          MCXA567VLQ
**                          MCXA567VPN
**
**     Compilers:
**                          GNU C Compiler
**                          IAR ANSI C/C++ Compiler for ARM
**                          Keil ARM C/C++ Compiler
**                          MCUXpresso Compiler
**
**     Reference manual:    MCXAP144M180FS6_RM_Rev.1_DraftC
**     Version:             rev. 2.0, 2024-10-29
**     Build:               b260805
**
**     Abstract:
**         CMSIS Peripheral Access Layer for MCXA567
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2024-03-26)
**         Initial version based on Rev1 DraftC RM
**     - rev. 2.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**
** ###################################################################
*/

/*!
 * @file MCXA567_COMMON.h
 * @version 2.0
 * @date 2024-10-29
 * @brief CMSIS Peripheral Access Layer for MCXA567
 *
 * CMSIS Peripheral Access Layer for MCXA567
 */

#if !defined(MCXA567_COMMON_H_)
#define MCXA567_COMMON_H_                        /**< Symbol preventing repeated inclusion */

/** Memory map major version (memory maps with equal major version number are
 * compatible) */
#define MCU_MEM_MAP_VERSION 0x0200U
/** Memory map minor version */
#define MCU_MEM_MAP_VERSION_MINOR 0x0000U


/* ----------------------------------------------------------------------------
   -- Interrupt vector numbers
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Interrupt_vector_numbers Interrupt vector numbers
 * @{
 */

/** Interrupt Number Definitions */
#define NUMBER_OF_INT_VECTORS 162                /**< Number of interrupts in the Vector table */

typedef enum IRQn {
  /* Auxiliary constants */
  NotAvail_IRQn                = -128,             /**< Not available device specific interrupt */

  /* Core interrupts */
  NonMaskableInt_IRQn          = -14,              /**< Non Maskable Interrupt */
  HardFault_IRQn               = -13,              /**< Cortex-M33 SV Hard Fault Interrupt */
  MemoryManagement_IRQn        = -12,              /**< Cortex-M33 Memory Management Interrupt */
  BusFault_IRQn                = -11,              /**< Cortex-M33 Bus Fault Interrupt */
  UsageFault_IRQn              = -10,              /**< Cortex-M33 Usage Fault Interrupt */
  SecureFault_IRQn             = -9,               /**< Cortex-M33 Secure Fault Interrupt */
  SVCall_IRQn                  = -5,               /**< Cortex-M33 SV Call Interrupt */
  DebugMonitor_IRQn            = -4,               /**< Cortex-M33 Debug Monitor Interrupt */
  PendSV_IRQn                  = -2,               /**< Cortex-M33 Pend SV Interrupt */
  SysTick_IRQn                 = -1,               /**< Cortex-M33 System Tick Interrupt */

  /* Device specific interrupts */
  Reserved16_IRQn              = 0,                /**< OR IRQ1 to IRQ53 */
  CMC_IRQn                     = 1,                /**< Core Mode Controller interrupt */
  DMA0_CH0_IRQn                = 2,                /**< DMA3_0_CH0 error or transfer complete */
  DMA0_CH1_IRQn                = 3,                /**< DMA3_0_CH1 error or transfer complete */
  DMA0_CH2_IRQn                = 4,                /**< DMA3_0_CH2 error or transfer complete */
  DMA0_CH3_IRQn                = 5,                /**< DMA3_0_CH3 error or transfer complete */
  DMA0_CH4_IRQn                = 6,                /**< DMA3_0_CH4 error or transfer complete */
  DMA0_CH5_IRQn                = 7,                /**< DMA3_0_CH5 error or transfer complete */
  DMA0_CH6_IRQn                = 8,                /**< DMA3_0_CH6 error or transfer complete */
  DMA0_CH7_IRQn                = 9,                /**< DMA3_0_CH7 error or transfer complete */
  ERM0_SINGLE_BIT_IRQn         = 10,               /**< ERM Single Bit error interrupt */
  ERM0_MULTI_BIT_IRQn          = 11,               /**< ERM Multi Bit error interrupt */
  FMU0_IRQn                    = 12,               /**< Flash Management Unit interrupt */
  GLIKEY0_IRQn                 = 13,               /**< GLIKEY Interrupt  */
  MBC0_IRQn                    = 14,               /**< MBC secure violation interrupt */
  SCG0_IRQn                    = 15,               /**< System Clock Generator interrupt */
  SPC0_IRQn                    = 16,               /**< System Power Controller interrupt */
  TDET_IRQn                    = 17,               /**< TDET interrrupt */
  WUU0_IRQn                    = 18,               /**< Wake Up Unit interrupt */
  CAN0_IRQn                    = 19,               /**< Controller Area Network 0 interrupt */
  CAN1_IRQn                    = 20,               /**< Controller Area Network 1 interrupt */
  FLEXIO_IRQn                  = 23,               /**< Flexible Input/Output interrupt */
  I3C0_IRQn                    = 24,               /**< Improved Inter Integrated Circuit interrupt 0 */
  I3C1_IRQn                    = 25,               /**< Improved Inter Integrated Circuit interrupt 1 */
  LPI2C0_IRQn                  = 26,               /**< Low-Power Inter Integrated Circuit 0 interrupt */
  LPI2C1_IRQn                  = 27,               /**< Low-Power Inter Integrated Circuit 1 interrupt */
  LPSPI0_IRQn                  = 28,               /**< Low-Power Serial Peripheral Interface 0 interrupt */
  LPSPI1_IRQn                  = 29,               /**< Low-Power Serial Peripheral Interface 1 interrupt */
  LPSPI2_IRQn                  = 30,               /**< Low-Power Serial Peripheral Interface 2 interrupt */
  LPUART0_IRQn                 = 31,               /**< Low-Power Universal Asynchronous Receive/Transmit 0 interrupt */
  LPUART1_IRQn                 = 32,               /**< Low-Power Universal Asynchronous Receive/Transmit 1 interrupt */
  LPUART2_IRQn                 = 33,               /**< Low-Power Universal Asynchronous Receive/Transmit 2 interrupt */
  LPUART3_IRQn                 = 34,               /**< Low-Power Universal Asynchronous Receive/Transmit 3 interrupt */
  LPUART4_IRQn                 = 35,               /**< Low-Power Universal Asynchronous Receive/Transmit 4 interrupt */
  CDOG0_IRQn                   = 38,               /**< Code Watchdog Timer 0 interrupt */
  CTIMER0_IRQn                 = 39,               /**< Standard counter/timer 0 interrupt */
  CTIMER1_IRQn                 = 40,               /**< Standard counter/timer 1 interrupt */
  CTIMER2_IRQn                 = 41,               /**< Standard counter/timer 2 interrupt */
  CTIMER3_IRQn                 = 42,               /**< Standard counter/timer 3 interrupt */
  CTIMER4_IRQn                 = 43,               /**< Standard counter/timer 4 interrupt */
  FREQME0_IRQn                 = 54,               /**< Frequency Measurement interrupt */
  LPTMR0_IRQn                  = 55,               /**< Low Power Timer 0 interrupt */
  OS_EVENT_IRQn                = 57,               /**< OS event timer interrupt */
  WAKETIMER0_IRQn              = 58,               /**< Wake Timer Interrupt */
  UTICK0_IRQn                  = 59,               /**< Micro-Tick Timer interrupt */
  WWDT0_IRQn                   = 60,               /**< Windowed Watchdog Timer 0 interrupt */
  WWDT1_IRQn                   = 61,               /**< Windowed Watchdog Timer 2 interrupt */
  ADC0_IRQn                    = 62,               /**< Analog-to-Digital Converter 0 interrupt */
  ADC1_IRQn                    = 63,               /**< Analog-to-Digital Converter 1 interrupt */
  CMP0_IRQn                    = 64,               /**< Comparator 0 interrupt */
  DAC0_IRQn                    = 67,               /**< Digital-to-Analog Converter 0 - General Purpose interrupt */
  DAC1_IRQn                    = 68,               /**< Digital-to-Analog Converter 1 - General Purpose interrupt */
  GPIO0_IRQn                   = 71,               /**< General Purpose Input/Output 0 interrupt 0 */
  GPIO1_IRQn                   = 72,               /**< General Purpose Input/Output 1 interrupt 0 */
  GPIO2_IRQn                   = 73,               /**< General Purpose Input/Output 2 interrupt 0 */
  GPIO3_IRQn                   = 74,               /**< General Purpose Input/Output 3 interrupt 0 */
  GPIO4_IRQn                   = 75,               /**< General Purpose Input/Output 4 interrupt 0 */
  GPIO5_IRQn                   = 76,               /**< General Purpose Input/Output 5 interrupt 0 */
  LPI2C2_IRQn                  = 77,               /**< Low-Power Inter Integrated Circuit 2 interrupt */
  LPI2C3_IRQn                  = 78,               /**< Low-Power Inter Integrated Circuit 3 interrupt */
  Reserved105_IRQn             = 89,               /**< Reserved interrupt */
  ETHERNET_IRQn                = 90,               /**< Ethernet QoS interrupt */
  ETHERNET_PMT_IRQn            = 91,               /**< Ethernet QoS power management interrupt */
  TENBASET_PHY0_IRQn           = 93,               /**< 10Base-T1S interrupt */
  I3C2_IRQn                    = 94,               /**< Improved Inter Integrated Circuit interrupt 2 */
  LPUART5_IRQn                 = 95,               /**< Low-Power Universal Asynchronous Receive/Transmit interrupt */
  LPSPI3_IRQn                  = 97,               /**< Low-Power Serial Peripheral Interface 3 interrupt */
  LPSPI4_IRQn                  = 98,               /**< Low-Power Serial Peripheral Interface 4 interrupt */
  LPSPI5_IRQn                  = 99,               /**< Low-Power Serial Peripheral Interface 5 interrupt */
  LPI2C4_IRQn                  = 100,              /**< Low-Power Inter Integrated Circuit 4 interrupt */
  I3C3_IRQn                    = 101,              /**< Improved Inter Integrated Circuit interrupt 3 */
  USB1_HS_IRQn                 = 103,              /**< USB High Speed OTG Controller interrupt  */
  USB1_HS_PHY_IRQn             = 104,              /**< USBHS DCD or USBHS Phy interrupt */
  FLEXSPI0_IRQn                = 106,              /**< Flexible Serial Peripheral Interface interrupt */
  SMARTDMA_IRQn                = 108,              /**< SmartDMA interrupt */
  CDOG1_IRQn                   = 109,              /**< Code Watchdog Timer 1 interrupt */
  PKC_IRQn                     = 110,              /**< PKC interrupt */
  SGI_IRQn                     = 111,              /**< SGI interrupt */
  Reserved128_IRQn             = 112,              /**< Reserved interrupt */
  TRNG0_IRQn                   = 113,              /**< True Random Number Generator interrupt */
  SECURE_ERR_IRQn              = 114,              /**< Secure IP Error interrupt. It OR SGI, PKC, TRNG error together.  */
  SEC_HYPERVISOR_CALL_IRQn     = 115,              /**< AHB Secure Controller hypervisor call interrupt */
  RTC_IRQn                     = 119,              /**< RTC alarm interrupt */
  DGDET0_IRQn                  = 122,              /**< Digital Glitch Detect 0 interrupt  */
  EWM_IRQn                     = 123,              /**< External Watchdog Monitor interrupt */
  Reserved140_IRQn             = 124,              /**< Reserved interrupt */
  Reserved141_IRQn             = 125,              /**< Reserved interrupt */
  GPIO0_1_IRQn                 = 126,              /**< General Purpose Input/Output 0 interrupt 1 */
  GPIO1_1_IRQn                 = 127,              /**< General Purpose Input/Output 1 interrupt 1 */
  GPIO2_1_IRQn                 = 128,              /**< General Purpose Input/Output 2 interrupt 1 */
  GPIO3_1_IRQn                 = 129,              /**< General Purpose Input/Output 3 interrupt 1 */
  GPIO4_1_IRQn                 = 130,              /**< General Purpose Input/Output 4 interrupt 1 */
  GPIO5_1_IRQn                 = 131,              /**< General Purpose Input/Output 5 interrupt 1 */
  ITRC0_IRQn                   = 133,              /**< Intrusion and Tamper Response Controller interrupt */
  DMA0_CH8_IRQn                = 134,              /**< DMA3_0_CH8 error or transfer complete */
  DMA0_CH9_IRQn                = 135,              /**< DMA3_0_CH9 error or transfer complete */
  DMA0_CH10_IRQn               = 136,              /**< DMA3_0_CH10 error or transfer complete */
  DMA0_CH11_IRQn               = 137,              /**< DMA3_0_CH11 error or transfer complete */
  DMA1_CH0_IRQn                = 142,              /**< DMA3_1_CH0 error or transfer complete */
  DMA1_CH1_IRQn                = 143,              /**< DMA3_1_CH1 error or transfer complete */
  DMA1_CH2_IRQn                = 144,              /**< DMA3_1_CH2 error or transfer complete */
  DMA1_CH3_IRQn                = 145               /**< DMA3_1_CH3 error or transfer complete */
} IRQn_Type;

/*!
 * @}
 */ /* end of group Interrupt_vector_numbers */


/* ----------------------------------------------------------------------------
   -- Cortex M33 Core Configuration
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Cortex_Core_Configuration Cortex M33 Core Configuration
 * @{
 */

